app/views/pizza_orders/index.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <tr>
        <td><%= pizza_order.order %></td>