app/views/pizza_orders/show.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Order:</strong>
  <%= @pizza_order.order %>