app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("street", "number", "city", "complement", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save

UPDATE "addresses" SET "street" = ?, "number" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["street", "Rua 13 de maio"], ["number", 500], ["updated_at", "2018-06-22 01:31:52.538803"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @address.update(address_params)