app/controllers/application_controller.rb

	def logged_in?
	  @current_user ||= User.find(session[:user_id]) if session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]