app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("payment_method", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["payment_method", "CARTAO_DEBITO"], ["customer_id", 2], ["created_at", "2018-06-22 01:11:16.949320"], ["updated_at", "2018-06-22 01:11:16.949320"]]