app/controllers/pizza_orders_controller.rb

  def index
    @pizza_orders = PizzaOrder.all
---
SELECT "pizza_orders".* FROM "pizza_orders"

  def create
    @pizza_order = PizzaOrder.new(pizza_order_params)

    respond_to do |format|
      if @pizza_order.save
---
INSERT INTO "pizza_orders" ("order_id", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["order_id", 1], ["pizza_id", 1], ["created_at", "2018-06-22 01:11:23.426442"], ["updated_at", "2018-06-22 01:11:23.426442"]]

    def set_pizza_order
      @pizza_order = PizzaOrder.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "pizza_orders".* FROM "pizza_orders" WHERE "pizza_orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]