app/controllers/pizzas_controller.rb

  def index
    @pizzas = Pizza.all
---
SELECT "pizzas".* FROM "pizzas"

  def create
    @pizza = Pizza.new(pizza_params)

    respond_to do |format|
      if @pizza.save
---
INSERT INTO "pizzas" ("flavours", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["flavours", "Alho e óleo"], ["price", 19.9], ["created_at", "2018-06-22 01:06:55.331460"], ["updated_at", "2018-06-22 01:06:55.331460"]]

    def set_pizza
      @pizza = Pizza.find(params[:id])
---
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]