app/controllers/users_controller.rb

	def create
		@user = User.new(allowed_params)
		if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "igor@mail.com"], ["created_at", "2018-06-23 15:03:10.750154"], ["updated_at", "2018-06-23 15:03:10.750154"]]